const data = [
  {
    question:
      "حداکثر سرعت مجازبرای سواری و وانت بارها دربزرگراهها برون شهری چقدر است؟",
    incorrectAnswers: [
      "120 کیلومتر بر ساعت",
      " 95 کیلومتر بر ساعت",
      "100 کیلومتر بر ساعت",
    ],
    correctAnswer: "110 کیلومتر بر ساعت",
    image: "/QuestionImages/S1.jpg",
  },

  {
    question:
      " چراغ های جلو وسایل نقلیه ای که در شانه راه ها ( به استثنای آزاد راه ها و بزرگراه ها) توقف می نمایند بادیدن حرکت وسایل نقلیه ای که از مقابل در حرکتند باید خاموش شود و برای تشخیص وجود و ابعاد وسیله نقلیه، چراغ های ……… و ……… را روشن نمایند.",
    incorrectAnswers: ["کوچک - راهنما", "بزرگ - جانبی", "کوچک - بزرگ"],
    correctAnswer: "کوچک - جانبی",
    image: "/QuestionImages/S2.jpg",
  },
  {
    question: "در خیابان‌ها و جاده‌هایی که نور کافی وجود دارد، ……………",
    incorrectAnswers: [
      "باید تنها از نور پایین استفاده نمود.",
      "تمام چراغ‌ ها را باید خاموش نمود.",
      "باید از نوربالا استفاده نمود",
    ],
    correctAnswer: "باید تنها از چراغ‌ های جانبی جلو و عقب استفاده نمود",
    image: "/QuestionImages/S3.jpg",
  },
  {
    question: "حق تقدم عبور را در تقاطع بالا مشخص کنید. ( براساس رنگ خودرو)",
    incorrectAnswers: [
      "نارنجی وسبز همزمان – قرمز",
      "سبز- قرمز – نارنجی",
      "نارنجی – سبز – قرمز",
    ],
    correctAnswer: "قرمز- سبز - نارنجی",
    image: "/QuestionImages/S4.jpg",
  },
  {
    question:
      " در راههای مسطح که دو طرف راه منتهی به کوه و پرتگاه می باشد حق تقدم عبور با کدامیک است؟",
    incorrectAnswers: [
      "وسیله ای که سمت کوه قرار دارد.",
      "هر دو وسیله حق تقدم عبور دارند.",
      "هیچکدام",
    ],
    correctAnswer: "وسیله ای که سمت پرتگاه قراردارد.",
    image: "/QuestionImages/S5.jpg",
  },
  {
    question: "در محل توقف(پارک) کنار خیابان حق تقدم با کیست؟",
    incorrectAnswers: [
      "هر دو حق تقدم دارند.",
      "هیچکدام",
      "وسیله نقلیه ای که بصورت مستقیم وارد پارک می شود.",
    ],
    correctAnswer: "وسیله ای که ضمن حرکت با دنده عقب مشغول پارک کردن است.",
    image: "/QuestionImages/S6.jpg",
  },
  {
    question:
      "حداقل فاصله طولی ایمنی در جاده برفی با سرعت۴۵ کیلومتر در ساعت چند طول اتومبیل است؟",
    incorrectAnswers: ["3", "6", "2"],
    correctAnswer: "9",
    image: "/QuestionImages/S7.jpg",
  },
  {
    question: "دور زدن در چند متری پیچ ها و تقاطع ها و تونل ها ممنوع است؟",
    incorrectAnswers: [" 120 متری", "50 متری", "100 متری"],
    correctAnswer: "150 متری",
    image: "/QuestionImages/S8.jpg",
  },
  {
    question:
      "برای امن‌ کردن محل حادثه با چه اقدامی می‌توان صحنه را عاری از خطر نمود؟",
    incorrectAnswers: [
      "مصدوم را تا حد ممکن از محل دور نمایید.",
      "مراقب سلامت خود باشید.",
      "خاموش‌ کردن وسیله نقلیه حادثه‌ دیده.",
    ],
    correctAnswer: "موارد ۱ و ۲",
    image: "/QuestionImages/S9.jpg",
  },
  {
    question:
      "در حال رانندگی در جاده خیس به دنبال اتومبیلی دیگر ، فاصله زمانی ایمن از اتومبیل جلویی چقدر باید باشد ؟",
    incorrectAnswers: ["6 ثانیه", "10 ثانیه", "8 ثانیه"],
    correctAnswer: "4 ثانیه",
    image: "/QuestionImages/S10.jpg",
  },
];

export default data;
